InformationRegisters/омг_ОстаткиНоменклатурыАптека.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ОстаткиНоменклатурыАптека</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_НоменклатураАптеки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аптека</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_Аптеки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_ЕдиницаХраненияАптеки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_ЕдиницаХраненияАптеки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_ДанныеРецептовАптек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ДанныеРецептовАптек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_СтатусыРецептов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рецепт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Рецепт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_НоменклатураАптеки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючРецепта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/омг_СтатусыРецептов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_СтатусыРецептов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неизвестен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/омг_РаботаСАптекамиСервер/Ext/Module.bsl
Процедура ПолучитьОстаткиАптек() Экспорт
	
	СоединениеHTTP = Новый HTTPСоединение("1c.ubtech.pro",443,"httpSalesOrder","Le6c^Yo)6by",,,Новый ЗащищенноеСоединениеOpenSSL(),);
	// обновим аптеки
	ЗапросHTTP = Новый HTTPЗапрос("/prod-atk-meditec/hs/so/stores");  
	Ответ = СоединениеHTTP.Получить(ЗапросHTTP); 
	Если Ответ.КодСостояния = 200 Тогда
		
		Сообщение = Ответ.ПолучитьТелоКакСтроку("UTF-8");
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Сообщение);
		ДанныеАптек = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_Аптеки.Ссылка КАК Ссылка,
		|	омг_Аптеки.ключ КАК ключ
		|ИЗ
		|	Справочник.омг_Аптеки КАК омг_Аптеки";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаАптекВБазе = РезультатЗапроса.Выбрать();  
		
		Для каждого СтрокаАптеки из ДанныеАптек Цикл
			
			ВыборкаАптекВБазе.Сбросить();	
			СтрПоиска = Новый Структура("ключ",СтрокаАптеки.store);
			
			Если ВыборкаАптекВБазе.НайтиСледующий(СтрПоиска) Тогда
				АптекаВбазе = ВыборкаАптекВБазе.Ссылка.ПолучитьОбъект()
			иначе
				АптекаВбазе = Справочники.омг_Аптеки.СоздатьЭлемент()
			КонецЕсли;	
			АптекаВбазе.Наименование = СтрокаАптеки.name;
			АптекаВбазе.ключ = СтрокаАптеки.store;
			АптекаВбазе.Записать();
		КонецЦикла	 
	Иначе
		//Сообщить("Код ответа: "+Ответ.КодСостояния);
		Возврат;
	КонецЕсли; 
	
	// загружаем номенклатуру
	ЗапросHTTP = Новый HTTPЗапрос("/prod-atk-meditec/hs/so/rests");  
	Ответ = СоединениеHTTP.Получить(ЗапросHTTP); 
	Если Ответ.КодСостояния = 200 Тогда
		
		Сообщение = Ответ.ПолучитьТелоКакСтроку("UTF-8");
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Сообщение);
		Остатки = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
	    МасНоменклатур = Новый Массив;
		МасЕдиниц = Новый Массив;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_Аптеки.Ссылка КАК Ссылка,
		|	омг_Аптеки.ключ КАК ключ
		|ИЗ
		|	Справочник.омг_Аптеки КАК омг_Аптеки";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаАптек = РезультатЗапроса.Выбрать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_НоменклатураАптеки.Ссылка КАК Ссылка,
		|	омг_НоменклатураАптеки.ключ КАК ключ
		|ИЗ
		|	Справочник.омг_НоменклатураАптеки КАК омг_НоменклатураАптеки
		|
		|СГРУППИРОВАТЬ ПО
		|	омг_НоменклатураАптеки.Ссылка,
		|	омг_НоменклатураАптеки.ключ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНоменклатура = РезультатЗапроса.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_ЕдиницаХраненияАптеки.Ссылка КАК Ссылка,
		|	омг_ЕдиницаХраненияАптеки.Наименование КАК Наименование
		|ИЗ
		|	Справочник.омг_ЕдиницаХраненияАптеки КАК омг_ЕдиницаХраненияАптеки
		|
		|СГРУППИРОВАТЬ ПО
		|	омг_ЕдиницаХраненияАптеки.Ссылка,
		|	омг_ЕдиницаХраненияАптеки.Наименование";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаЕдиницыХранения = РезультатЗапроса.Выгрузить();
		ЕдиницаХранения = Справочники.омг_ЕдиницаХраненияАптеки.ПустаяСсылка();
		
		ОстаткиАптекВБазе = РегистрыСведений.омг_ОстаткиНоменклатурыАптека.СоздатьМенеджерЗаписи();	
		ОстаткиАптекВБазе.Записать();
		ОстаткиАптекВБазе = РегистрыСведений.омг_ОстаткиНоменклатурыАптека.СоздатьНаборЗаписей(); 
		
		Для каждого строкаОстатки из Остатки Цикл
			
			СтрПоискаАптеки = Новый Структура("ключ",строкаОстатки.store);
			ВыборкаАптек.Сбросить(); 
			
			Если ВыборкаАптек.НайтиСледующий(СтрПоискаАптеки) Тогда
				Аптека = ВыборкаАптек.Ссылка;
			иначе
				продолжить
			КонецЕсли;		

			//СтрПоискаНоменклатуры = Новый Структура("ключ",строкаОстатки.id);
			//ВыборкаНоменклатура.Сбросить(); 
			//
			//Если ВыборкаНоменклатура.НайтиСледующий(СтрПоискаНоменклатуры) Тогда 
			НайдСтрНоменклатура = ВыборкаНоменклатура.Найти(строкаОстатки.id,"ключ");
			Если не НайдСтрНоменклатура = Неопределено Тогда
				Номенклатура = НайдСтрНоменклатура.Ссылка;
			иначе  
				Номенклатура = Справочники.омг_НоменклатураАптеки.СоздатьЭлемент();
				Номенклатура.Наименование = строкаОстатки.name;
				Номенклатура.ключ         = строкаОстатки.id;
				Номенклатура.Записать();
				Номенклатура = Номенклатура.Ссылка;    
				НовНоменклатура = ВыборкаНоменклатура.Добавить();  
				НовНоменклатура.Ссылка = Номенклатура;
				НовНоменклатура.ключ = строкаОстатки.id;
			КонецЕсли;	       
			
			//СтрПоискаВыборкаЕдиницыХранения = Новый Структура("Наименование",строкаОстатки.unit);
			//ВыборкаЕдиницыХранения.Сбросить(); 
			//
            НайдСтрЕдиница = ВыборкаЕдиницыХранения.Найти(строкаОстатки.unit,"Наименование");
			Если не НайдСтрЕдиница = Неопределено Тогда					
			//Если ВыборкаЕдиницыХранения.НайтиСледующий(СтрПоискаВыборкаЕдиницыХранения) Тогда
				ЕдиницаХранения = НайдСтрЕдиница.Ссылка;
			иначе
				ЕдиницаХранения = Справочники.омг_ЕдиницаХраненияАптеки.СоздатьЭлемент();
				ЕдиницаХранения.Наименование = строкаОстатки.unit;  
				ЕдиницаХранения.Записать();
				ЕдиницаХранения = ЕдиницаХранения.Ссылка; 
				НовЕдиница = ВыборкаЕдиницыХранения.Добавить();  
				НовЕдиница.Ссылка = ЕдиницаХранения;
				НовЕдиница.Наименование = строкаОстатки.unit;
			КонецЕсли;   
	
			ЗаписьВбазе = ОстаткиАптекВБазе.Добавить();
			
			ЗаписьВбазе.Номенклатура = Номенклатура; 
			ЗаписьВбазе.Аптека = Аптека; 
			ЗаписьВбазе.омг_ЕдиницаХраненияАптеки = ЕдиницаХранения;
			ЗаписьВбазе.ДатаОстатков = ТекущаяДата(); 
			ЗаписьВбазе.Количество = строкаОстатки.qnt;

		КонецЦикла;	
		ОстаткиАптекВБазе.Записать();	
	Иначе
		//Сообщить("Код ответа: "+Ответ.КодСостояния); 
	КонецЕсли;    
	
КонецПроцедуры    


Функция омг_ОбновитьСтатусРецептаНаСервере(омг_ключ = "",Ссылка) Экспорт
	
	Если ЗначениеЗаполнено(омг_ключ) Тогда
		ВозрЗначение = "";
		УстановитьПривилегированныйРежим(Истина);
		СоединениеHTTP = Новый HTTPСоединение("1c.ubtech.pro",443,"httpSalesOrder","Le6c^Yo)6by",,,Новый ЗащищенноеСоединениеOpenSSL(),);
		ЗапросHTTP = Новый HTTPЗапрос("/prod-atk-meditec/hs/so/order?order="+омг_ключ);  
		//отсылаем POST-запрос на обработку.
		ОтветHTTP = СоединениеHTTP.ВызватьHTTPМетод("GET", ЗапросHTTP);
		Если ОтветHTTP.КодСостояния = 200 Тогда	
			Сообщение = ОтветHTTP.ПолучитьТелоКакСтроку("UTF-8");
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Сообщение);
			ДанныеРецепта = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть(); 	
			ВозрЗначение = ДанныеРецепта.status;
			
			МасНоменклатур = Новый Массив;
			ТабТовары = Новый ТаблицаЗначений;
			ТипСтрока = Новый ОписаниеТипов("Строка");
			ТипЧисло = Новый ОписаниеТипов("Число");
			ТабТовары.Колонки.Добавить("id",ТипСтрока);
			ТабТовары.Колонки.Добавить("qnt",ТипЧисло); 
			ТабТовары.Колонки.Добавить("price",ТипЧисло);
			ТабТовары.Колонки.Добавить("sum",ТипЧисло); 
			
			Для каждого строка из ДанныеРецепта.goods Цикл
				МасНоменклатур.Добавить(строка.id);	
				ЗаполнитьЗначенияСвойств(ТабТовары.Добавить(),строка);
			КонецЦикла;	
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	омг_НоменклатураАптеки.Ссылка КАК Ссылка,
			|	омг_НоменклатураАптеки.ключ КАК ключ
			|ИЗ
			|	Справочник.омг_НоменклатураАптеки КАК омг_НоменклатураАптеки
			|ГДЕ
			|	омг_НоменклатураАптеки.ключ В(&МассивНоменклатур)";
			
			Запрос.УстановитьПараметр("МассивНоменклатур", МасНоменклатур);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаНоменклатур = РезультатЗапроса.Выбрать();
			ТабТовары.Свернуть("id","qnt,price,sum");
			Набор = РегистрыСведений.омг_ДанныеРецептовАптек.СоздатьНаборЗаписей();	
			Набор.Отбор.КлючРецепта.Установить(ДанныеРецепта.order_id);
			Набор.Записать();	
			Набор = РегистрыСведений.омг_ДанныеРецептовАптек.СоздатьНаборЗаписей();	
			Набор.Отбор.КлючРецепта.Установить(ДанныеРецепта.order_id);
			Если ДанныеРецепта.status = "НеСогласован" Тогда
				Статус = Перечисления.омг_СтатусыРецептов.НеСогласован				
			ИначеЕсли ДанныеРецепта.status = "Согласован" Тогда
				Статус = Перечисления.омг_СтатусыРецептов.Согласован
			ИначеЕсли ДанныеРецепта.status = "Закрыт" Тогда  
				Статус = Перечисления.омг_СтатусыРецептов.Закрыт
			иначе Статус = Перечисления.омг_СтатусыРецептов.Неизвестен	
			КонецЕсли;
			Период = ТекущаяДата();
					
			Для каждого строка из ТабТовары Цикл 
				ВыборкаНоменклатур.Сбросить();
				СтрПоиска = Новый Структура;
				СтрПоиска.Вставить("ключ",строка.id);    
				Если ВыборкаНоменклатур.НайтиСледующий(СтрПоиска) Тогда
					Номенклатура = ВыборкаНоменклатур.Ссылка;	
				Иначе
					Продолжить;
				КонецЕсли;
				Запись01 = Набор.Добавить();
				Запись01.Период = Период;
				Запись01.Статус = Статус;
				Запись01.Рецепт = Ссылка;
				Запись01.Номенклатура = Номенклатура;
				Запись01.КлючРецепта = ДанныеРецепта.order_id;	
				Запись01.Количество = строка.qnt;
				Запись01.Цена = строка.price;
				Запись01.Сумма = строка.sum;
			КонецЦикла;	 
			Набор.Записать();
		иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось обновить статус рецепта! Код: " + ОтветHTTP.КодСостояния;
			Сообщение.Сообщить();	
		КонецЕсли; 
		
		УстановитьПривилегированныйРежим(Ложь);	  
		
	иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед обновлением статуса необходимо отправить рецепт!"; 
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
	Возврат ВозрЗначение;
	
КонецФункции  


 Функция омг_ВернутьНоменклатуруРецептаНаСервере(Ссылка) Экспорт
			 
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	омг_ДанныеРецептовАптек.Номенклатура КАК Номенклатура,
		 |	омг_ДанныеРецептовАптек.Количество КАК Количество,
		 |	омг_ДанныеРецептовАптек.Цена КАК Цена,
		 |	омг_ДанныеРецептовАптек.Сумма КАК Сумма
		 |ИЗ
		 |	РегистрСведений.омг_ДанныеРецептовАптек КАК омг_ДанныеРецептовАптек
		 |ГДЕ
		 |	омг_ДанныеРецептовАптек.Рецепт = &Ссылка";
		 
		 Запрос.УстановитьПараметр("Ссылка", Ссылка);
		 
		 РезультатЗапроса = Запрос.Выполнить();
		 
		 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		 
		 
		 МАсВозврата = Новый Массив; 
		 
		 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			 
			 СтрВозврата = Новый Структура;
			 СтрВозврата.Вставить("ЛекарственноеСредство",ВыборкаДетальныеЗаписи.Номенклатура);
			 СтрВозврата.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);   
			 СтрВозврата.Вставить("Цена",ВыборкаДетальныеЗаписи.Цена);  
			 СтрВозврата.Вставить("Сумма",ВыборкаДетальныеЗаписи.Сумма);
			 МАсВозврата.Добавить(СтрВозврата);
		 КонецЦикла;
		 
		 Возврат МАсВозврата;
	
КонецФункции
